# 10. 行数のカウント
行数をカウントせよ．確認にはwcコマンドを用いよ．

In [6]:
import pandas as pd
df = pd.read_csv('popular-names.txt', sep='\t',names=('name', 'gender', 'number', 'year'))
len(df)

2780

# 11. タブをスペースに置換
タブ1文字につきスペース1文字に置換せよ．確認にはsedコマンド，trコマンド，もしくはexpandコマンドを用いよ．

In [7]:
df.to_csv('popular-names-1.txt',sep=' ')

# 12. 1列目をcol1.txtに，2列目をcol2.txtに保存
各行の1列目だけを抜き出したものをcol1.txtに，2列目だけを抜き出したものをcol2.txtとしてファイルに保存せよ．確認にはcutコマンドを用いよ．

In [8]:
df['name'].to_csv('col1.txt', sep='\t')
df['gender'].to_csv('col2.txt', sep='\t')

<ipython-input-8-f253930bae6a>:1: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  df['name'].to_csv('col1.txt', sep='\t')
<ipython-input-8-f253930bae6a>:2: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  df['gender'].to_csv('col2.txt', sep='\t')

# 13. col1.txtとcol2.txtをマージ
12で作ったcol1.txtとcol2.txtを結合し，元のファイルの1列目と2列目をタブ区切りで並べたテキストファイルを作成せよ．確認にはpasteコマンドを用いよ．

In [17]:
df1= pd.concat([df['name'],df['gender']])
df1.to_csv('col12.txt', sep='\t')

<ipython-input-17-2a07e256cb76>:2: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  df1.to_csv('col12.txt', sep='\t')

# 14. 先頭からN行を出力
自然数Nをコマンドライン引数などの手段で受け取り，入力のうち先頭のN行だけを表示せよ．確認にはheadコマンドを用いよ

In [19]:
df.head(5)

        name gender  number  year
0       Mary      F    7065  1880
1       Anna      F    2604  1880
2       Emma      F    2003  1880
3  Elizabeth      F    1939  1880
4     Minnie      F    1746  1880

# 15. 末尾のN行を出力
自然数Nをコマンドライン引数などの手段で受け取り，入力のうち末尾のN行だけを表示せよ．確認にはtailコマンドを用いよ．

In [20]:
df.tail(5)

          name gender  number  year
2775  Benjamin      M   13381  2018
2776    Elijah      M   12886  2018
2777     Lucas      M   12585  2018
2778     Mason      M   12435  2018
2779     Logan      M   12352  2018

# 16. ファイルをN分割する
自然数Nをコマンドライン引数などの手段で受け取り，入力のファイルを行単位でN分割せよ．同様の処理をsplitコマンドで実現せよ

In [24]:
 def split_df(dataframe, num):
        badge=len(dataframe) // num
        return dataframe[:badge]

split_df(df,5)

          name gender  number  year
0         Mary      F    7065  1880
1         Anna      F    2604  1880
2         Emma      F    2003  1880
3    Elizabeth      F    1939  1880
4       Minnie      F    1746  1880
..         ...    ...     ...   ...
551    William      M    6904  1907
552      James      M    6707  1907
553     George      M    4445  1907
554     Robert      M    4020  1907
555    Charles      M    3884  1907

[556 rows x 4 columns]

# 17. １列目の文字列の異なり
1列目の文字列の種類（異なる文字列の集合）を求めよ．確認にはcut, sort, uniqコマンドを用いよ．

In [33]:
df['name'].unique()

array(['Mary', 'Anna', 'Emma', 'Elizabeth', 'Minnie', 'Margaret', 'Ida',
       'Alice', 'Bertha', 'Sarah', 'John', 'William', 'James', 'Charles',
       'George', 'Frank', 'Joseph', 'Thomas', 'Henry', 'Robert', 'Annie',
       'Edward', 'Clara', 'Florence', 'Ethel', 'Bessie', 'Harry', 'Helen',
       'Ruth', 'Marie', 'Lillian', 'Mildred', 'Dorothy', 'Frances',
       'Walter', 'Evelyn', 'Virginia', 'Richard', 'Betty', 'Donald',
       'Doris', 'Shirley', 'Barbara', 'Patricia', 'Joan', 'Nancy',
       'Carol', 'David', 'Ronald', 'Judith', 'Linda', 'Sandra', 'Carolyn',
       'Sharon', 'Michael', 'Susan', 'Donna', 'Larry', 'Kathleen',
       'Deborah', 'Gary', 'Karen', 'Debra', 'Pamela', 'Cynthia', 'Mark',
       'Steven', 'Lisa', 'Jeffrey', 'Lori', 'Kimberly', 'Tammy', 'Angela',
       'Michelle', 'Jennifer', 'Melissa', 'Christopher', 'Brian', 'Amy',
       'Laura', 'Tracy', 'Julie', 'Jason', 'Scott', 'Stephanie',
       'Heather', 'Nicole', 'Matthew', 'Rebecca', 'Jessica', 'Amanda',
       'Daniel', 'Kelly', 'Joshua', 'Crystal', 'Ashley', 'Megan',
       'Brittany', 'Andrew', 'Justin', 'Samantha', 'Lauren', 'Emily',
       'Brandon', 'Tyler', 'Taylor', 'Nicholas', 'Jacob', 'Hannah',
       'Austin', 'Alexis', 'Rachel', 'Madison', 'Abigail', 'Olivia',
       'Ethan', 'Anthony', 'Isabella', 'Ava', 'Sophia', 'Chloe',
       'Alexander', 'Mia', 'Jayden', 'Noah', 'Aiden', 'Mason', 'Liam',
       'Charlotte', 'Harper', 'Benjamin', 'Elijah', 'Amelia', 'Logan',
       'Oliver', 'Lucas'], dtype=object)

# 18. 各行を3コラム目の数値の降順にソート
各行を3コラム目の数値の逆順で整列せよ（注意: 各行の内容は変更せずに並び替えよ）．確認にはsortコマンドを用いよ（この問題はコマンドで実行した時の結果と合わなくてもよい）．

In [30]:
df.sort_values('number', ascending =False)

         name gender  number  year
1340    Linda      F   99689  1947
1360    Linda      F   96211  1948
1350    James      M   94757  1947
1550  Michael      M   92704  1957
1351   Robert      M   91640  1947
...       ...    ...     ...   ...
27      Annie      F    1326  1881
28     Bertha      F    1324  1881
8      Bertha      F    1320  1880
29      Alice      F    1308  1881
9       Sarah      F    1288  1880

[2780 rows x 4 columns]

# 19. 各行の1コラム目の文字列の出現頻度を求め，出現頻度の高い順に並べる
各行の1列目の文字列の出現頻度を求め，その高い順に並べて表示せよ．確認にはcut, uniq, sortコマンドを用いよ．

In [34]:
df['name'].value_counts()

James      118
William    111
Robert     108
John       108
Mary        92
          ...
Rachel       1
Tracy        1
Julie        1
Carolyn      1
Laura        1
Name: name, Length: 136, dtype: int64